In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(":memory:")
cur = con.cursor()

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
link = 'https://raw.githubusercontent.com/eric-bunch/boston_housing/master/boston.csv'

In [4]:
data = pd.read_csv(link)
data.rename(columns = {'MDEV':'MEDV'}, inplace=True)
data

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88,11.9

In [5]:
data.to_sql("boston", con, index=False, if_exists="replace")

506

In [6]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [144]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

1. Выведите количество пустых значений по колонкам CRIM, ZN, INDUS, CHAS, NOX (название колонки, кол-во пустых значений)

In [12]:
pd.read_sql(
    """
    SELECT  sum(CRIM = 0) CRIM,
            sum(ZN = 0) ZN,
            sum(INDUS = 0) INDUS,
            sum(CHAS = 0) CHAS,
            sum(NOX = 0) NOX
    FROM boston;

    """,
    con,
)

   CRIM   ZN  INDUS  CHAS  NOX
0     0  372      0   471    0

In [146]:
pd.read_sql(
    """
    SELECT  sum(CRIM is null) CRIM,
            sum(ZN is null) ZN,
            sum(INDUS is null) INDUS,
            sum(CHAS is null) CHAS,
            sum(NOX is null) NOX
    FROM boston;

    """,
    con,
)

   CRIM  ZN  INDUS  CHAS  NOX
0     0   0      0     0    0

2. Выведите количество уникальных значений по колонокам CRIM, ZN, INDUS, CHAS, NOX (название колонки, кол-во уникальных значений)

In [9]:
pd.read_sql(
    """
    SELECT  count(DISTINCT CRIM) CRIM,
            count(DISTINCT ZN) ZN,
            count(DISTINCT INDUS) INDUS,
            count(DISTINCT CHAS) CHAS,
            count(DISTINCT NOX) NOX
    FROM boston
    """,
    con,
)

   CRIM  ZN  INDUS  CHAS  NOX
0   504  26     76     2   81

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки) выбирая из CRIM, ZN, INDUS, CHAS, NOX.
Напишите какой вывод можно сделать по данным в этих колонках

In [10]:
pd.read_sql(
    """

WITH tbl AS (
            SELECT  'CRIM' param, count() over() cnt_min
            FROM boston
            WHERE   CRIM = (SELECT min(CRIM) FROM boston)

            UNION

            SELECT  'ZN' param, count() over() cnt_min
            FROM boston
            WHERE   ZN = (SELECT min(ZN) FROM boston)

            UNION

            SELECT  'INDUS' param, count() over() cnt_min
            FROM boston
            WHERE   INDUS = (SELECT min(INDUS) FROM boston)

            UNION

            SELECT  'CHAS' param, count() over() cnt_min
            FROM boston
            WHERE   CHAS = (SELECT min(CHAS) FROM boston)

            UNION

            SELECT  'NOX' param, count() over() cnt_min
            FROM boston
            WHERE   NOX = (SELECT min(NOX) FROM boston)

            UNION

            SELECT  'total_rows' param, count() over() cnt_min
            FROM boston
            )

SELECT param FROM tbl
WHERE cnt_min > (SELECT max(cnt_min) FROM tbl)/2 and param <> 'total_rows'
    """,
    con,
)

  param
0  CHAS
1    ZN

Вывод: так как в колонках CHAS и ZN медиана равна минимальному значению, то, для этих параметров, оно является наиболее вероятным

4. Выведите разницу между среднем количеством комнат(RM) в домах с самой дорогой стоимостью(MEDV) и 25 самыми дешевыми домами. 
Аналогично по 50, 100, 200, 300 самыми дешевыми домами. (кол-во домов(25,50,100,200,300), среднее кол-во комнат в них, среднее кол-во комнат в самых дорогих, разница).
Напишите влияет ли кол-во комнат на стоимость и как сильно.

In [89]:
pd.read_sql(
    """
    SELECT  num_houses,
            max_avg_rm_order_medv avg_expensive_house,
            avg_rm_сum avg_cheap_house,
            max_avg_rm_order_medv - avg_rm_сum diff
    FROM (
            SELECT  avg_rm_сum,
                    num_houses,
                    avg_rm_order_medv,
                    max(avg_rm_order_medv) over () max_avg_rm_order_medv,
                    MEDV,
                    max_medv
            FROM
                (
                SELECT  MEDV,
                        avg(RM) over(ORDER BY MEDV DESC) avg_rm_order_medv,
                        max(MEDV) over() max_medv,
                        row_number() over(ORDER BY MEDV) num_houses,
                        avg(RM) over(ORDER BY MEDV ROWS UNBOUNDED PRECEDING) avg_rm_сum
                FROM boston
                )
            WHERE num_houses IN (25, 50, 100, 200, 300)
                OR MEDV = max_medv
            ORDER BY num_houses
            )
    WHERE MEDV <> max_medv
    """,
    con,
)

   num_houses  avg_expensive_house  avg_cheap_house      diff
0          25                7.484         5.747840  1.736160
1          50                7.484         5.753240  1.730760
2         100                7.484         5.887120  1.596880
3         200                7.484         5.911705  1.572295
4         300                7.484         5.972227  1.511773

При увеличении количества комнат цена увеличивается. На самых дешевых домах данная тенденция слабо выражена, т.е. цена растет почти независимо от количества комнат. При последовательном увеличении выборки зависимость уже хорошо видна.

5. Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг). Напишите какой вывод можно сделать по этим данным.

In [92]:
pd.read_sql(
    """
    SELECT  LSTAT,
            MEDV,
            rank
    FROM (
        SELECT  LSTAT,
                MEDV,
                rank() over(ORDER BY LSTAT) as rank,
                max(MEDV) over() max_MEDV
        FROM boston
        )
    WHERE MEDV = max_MEDV
    """,
    con,
)

    LSTAT  MEDV  rank
0    1.73  50.0     1
1    1.92  50.0     2
2    2.88  50.0     6
3    2.96  50.0     8
4    2.97  50.0     9
5    3.16  50.0    15
6    3.26  50.0    17
7    3.32  50.0    18
8    3.70  50.0    26
9    3.73  50.0    27
10   4.45  50.0    41
11   4.63  50.0    50
12   5.12  50.0    67
13   7.44  50.0   141
14   8.88  50.0   181
15   9.53  50.0   203

Вывод: численность населения с низким статусом в домах с самой дорогой стоимостью довольно мала (не превышает 10%).

6. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [105]:
pd.read_sql(
    """
    SELECT DISTINCT CASE
                    WHEN CHAS = 1
                    THEN 'граничит'
                    ELSE 'не граничит'
                    END CHAS,
            avg(MEDV) over(PARTITION BY CHAS) avg_MEDV
    FROM boston
    """,
    con,
)

          CHAS   avg_MEDV
0     не граничит  22.093843
1  граничит  28.440000

7. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки) выбирая из CRIM, ZN, INDUS, CHAS, NOX. Напишите какой вывод можно сделать по этим данным.

In [127]:
pd.read_sql(
    """
    WITH tbl AS (
                SELECT  distinct CHAS,
                        avg(CRIM) over(PARTITION BY CHAS) avg_CRIM,
                        avg(ZN) over(PARTITION BY CHAS) avg_ZN,
                        avg(INDUS) over(PARTITION BY CHAS) avg_INDUS,
                        avg(CHAS) over(PARTITION BY CHAS) avg_CHAS,
                        avg(NOX) over(PARTITION BY CHAS) avg_NOX
                FROM boston
                )

    SELECT 'CRIM' param FROM tbl
    WHERE CHAS = 1 and avg_CRIM = (SELECT max(avg_CRIM) FROM tbl)

    UNION

    SELECT 'ZN' param FROM tbl
    WHERE CHAS = 1 and avg_ZN = (SELECT max(avg_ZN) FROM tbl)

    UNION

    SELECT 'INDUS' param FROM tbl
    WHERE CHAS = 1 and avg_INDUS = (SELECT max(avg_INDUS) FROM tbl)

    UNION

    SELECT 'CHAS' param FROM tbl
    WHERE CHAS = 1 and avg_CHAS = (SELECT max(avg_CHAS) FROM tbl)

    UNION

    SELECT 'NOX' param FROM tbl
    WHERE CHAS = 1 and avg_NOX = (SELECT max(avg_NOX) FROM tbl)

    """,
    con,
)

   param
0   CHAS
1  INDUS
2    NOX

Вывод: если дом граничит с рекой то доля акров промышленной застройки на город выше, но выше и концентрация оксидов азота. Вероятно промышленная деятельность влияет на повышение выброса оксидов азота.

8. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [143]:
pd.read_sql(
    """
    SELECT  distinct percentile,
            max(INDUS) over(PARTITION BY percentile) max_INDUS_pers,
            max(NOX) over(PARTITION BY percentile) max_NOX_pers
    FROM (
        SELECT  INDUS,
                NOX,
                (NTILE(10) OVER (ORDER BY INDUS))*10 AS percentile
        FROM boston
        )
    """,
    con,
)

   percentile  max_INDUS_pers  max_NOX_pers
0          10            2.89         0.538
1          20            4.39         0.647
2          30            5.96         0.515
3          40            7.38         0.507
4          50            9.69         0.585
5          60           13.89         0.585
6          70           18.10         0.770
7          80           18.10         0.740
8          90           19.58         0.871
9         100           27.74         0.871

Если в минимальных значениях сложно оценить влияние промышленной застройки на количество выбросов оксидов азота, то в более больших масштабах заметен значительный рост количества выбросов.

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.